const gu = document.getElementById('gu');
const dong = document.getElementById('dong');

const seoul = {
    "": ["동명"],
    "강남": ['대치동', '개포동', '삼성동', '압구정동', '역삼동', '청담동', '논현동', '도곡동', '일원동', '수서동', '신사동', '자곡동',
    '율현동', '세곡동'],
    "서초": ['서초동', '방배동', '반포동', '양재동', '잠원동', '우면동', '신원동', '내곡동'],
    "송파": ['신천동', '문정동', '방이동', '가락동', '풍납동', '잠실동', '장지동', '거여동', '삼전동', '오금동', '석촌동', '송파동', '마천동'],
    "강동": ['암사동', '명일동', '고덕동', '상일동', '강일동', '길동', '천호동', '성내동', '둔촌동'],
    "광진": ['광장동', '자양동', '구의동', '중곡동', '화양동', '군자동', '능동'],
    "중랑": ['면목동', '신내동', '상봉동', '묵동', '망우동', '중화동'],
    "노원": ['상계동', '중계동', '공릉동', '하계동', '월계동'],
    "도봉": ['창동', '쌍문동', '방학동', '도봉동'],
    "강북": ['수유동', '미아동', '번동', '우이동'],
    "성북": ['석관동', '길음동', '정릉동', '돈암동', '하월곡동', '장위동', '상월곡동', '종암동', '안암동5가', '보문동2가', '삼선동4가',
    '보문동6가', '동소문동5가', '삼선동2가', '보문동3가', '안암동3가', '보문동4가', '삼선동3가', '동선동4가', '동선동1가',
    '동소문동4가', '성북동', '삼선동5가', '동소문동7가', '안암동1가', '성북동1가', '안암동4가', '보문동1가', '동소문동6가',
    '동선동3가', '동선동5가'],
    "동대문": ['용두동', '이문동', '답십리동', '전농동', '장안동', '휘경동', '회기동', '청량리동', '제기동', '신설동'],
    "성동": ['성수동1가', '하왕십리동', '옥수동', '금호동2가', '응봉동', '행당동', '금호동4가', '사근동', '성수동2가', '금호동1가', '마장동', '금호동3가', '상왕십리동', '용답동', '송정동', '홍익동', '도선동'],
    "중": ['황학동', '충무로4가', '순화동', '신당동', '남창동', '정동', '회현동2가', '흥인동', '오장동', '인현동2가', '회현동1가', '충무로5가', '남대문로5가', '중림동', '묵정동', '을지로5가', '장충동2가', '예장동', '필동3가', '장충동1가', '만리동2가', '만리동1가', '필동1가', '남산동2가', '산림동'],
    "종로": ['연건동', '숭인동', '누상동', '효제동', '무악동', '충신동', '창신동', '명륜2가', '동숭동', '익선동', '평창동', '평동', '이화동', '교북동', '사직동', '명륜1가', '내수동', '홍파동', '행촌동', '인의동', '신영동', '연지동', '당주동', '필운동', '수송동', '견지동', '신교동', '부암동', '신문로2가', '구기동', '신문로1가', '통인동', '옥인동', '청운동', '명륜3가', '혜화동'],
    "은평": ['역촌동', '녹번동', '신사동', '수색동', '응암동', '불광동', '대조동', '갈현동', '증산동', '진관동', '구산동'],
    "서대문": ['홍제동', '연희동', '북가좌동', '남가좌동', '북아현동', '홍은동', '현저동', '대현동', '창천동', '천연동', '충정로3가', '영천동', '합동', '냉천동', '충정로2가'],
    "용산": ['이촌동', '보광동', '원효로4가', '한강로1가', '한남동', '한강로2가', '후암동', '산천동', '문배동', '용산동2가', '한강로3가', '청파동3가', '도원동', '효창동', '이태원동', '동자동', '원효로1가', '용산동5가', '신계동', '청암동', '서빙고동', '용문동', '신창동', '원효로2가', '동빙고동', '원효로3가', '청파동1가', '갈월동', '주성동'],
    "마포": ['현석동', '연남동', '상암동', '공덕동', '도화동', '중동', '성산동', '아현동', '서교동', '신공덕동', '노고산동', '염리동', '망원동', '상수동', '합정동', '신수동', '대흥동', '창전동', '용강동', '마포동', '동교동', '신정동', '토정동', '하중동', '구수동'],
    "강서": ['마곡동', '염창동', '공항동', '화곡동', '내발산동', '방화동', '가양동', '등촌동'],
    "양천": ['목동', '신월동', '신정동'],
    "구로": ['신도림동', '오류동', '구로동', '개봉동', '고척동', '천왕동', '항동', '온수동', '궁동', '가리봉동'],
    "영등포": ['양평동5가', '영등포동1가', '당산동', '신길동', '양평동1가', '당산동4가', '양평동4가', '여의도동', '대림동', '영등포동7가', '양평동3가', '영등포동2가', '당산동2가', '당산동5가', '영등포동8가', '문래동5가', '당산동3가', '문래동3가', '영등포동4가', '영등포동', '영등포동3가', '당산동6가', '문래동6가', '도림동', '양평동6가', '문래동4가', '당산동1가', '양평동2가', '문래동2가', '영등포동5가'],
    "동작": ['상도동', '신대방동', '사당동', '흑석동', '노량진동', '본동', '대방동', '상도1동', '동작동'],
    "관악": ['봉천동', '신림동', '남현동'],
    "금천": ['독산동', '가산동', '시흥동'],
    // 다른 구 및 동 리스트를 추가하세요
}

function fillDongList() {
    const guValue = gu.value;
    const dongs = seoul[guValue];

    dong.innerHTML = "동명"; // 기존 동 리스트를 비웁니다.

    for (const d of dongs) {
        const optionElement = document.createElement('option');
        optionElement.value = d;
        optionElement.textContent = d;
        dong.appendChild(optionElement);
    }
}

gu.addEventListener("change", fillDongList); // 구를 변경할 때마다 동 리스트를 업데이트합니다.
fillDongList(); // 페이지가 로드되면 초기 동 리스트를 채웁니다.
